import { Container } from "../../../styles/common";
import * as SC from "./AboutSection.styled";

export const AboutSection = () => {
  return (
    <SC.AboutSection>
      <SC.Logo />
      <Container>
        <SC.Title>Про компанію</SC.Title>
        <SC.DescList>
          <SC.DescItem>
            <SC.Description>
              Компанія Міст Консалт відзначається своєю відданістю меті -
              створення найзручнішого та найефективнішого механізму взаємодії
              між нашими клієнтами та різноманітними органами державної влади,
              місцевого самоврядування, різноманітними проектними організаціями
              та профільними підприємствами з метою комплексного вирішення
              складних завдань у сфері земельних відносин, містобудування та
              архітектури.
            </SC.Description>
          </SC.DescItem>
          <SC.DescItem>
            <SC.Description>
              Наші юристи, зі значним досвідом у цій галузі, відзначаються
              ретельним вивченням кожного питання та орієнтуванням на поставлені
              цілі, щоб підібрати максимально ефективний алгоритм роботи та
              забезпечити його поетапне втілення в життя. Ми готові виконати
              будь-яку складну задачу та гарантуємо своїм клієнтам високу якість
              послуг та підтримку на кожному етапі співпраці.
            </SC.Description>
          </SC.DescItem>
        </SC.DescList>
      </Container>
    </SC.AboutSection>
  );
};
